["How can you tell when a programmer has had sex?\nWhen he's washing the pepper spray out of his eyes.", "Two bytes meet.  The first byte asks, 'Are you ill?'  \nThe second byte replies, 'No, just feeling a bit off.'", "Eight bytes walk into a bar.  The bartender asks, 'Can I get you anything?'\n\n'Yeah,' reply the bytes.  'Make us a double.'", "Q. How did the programmer die in the shower?\nA. He read the shampoo bottle instructions: Lather. Rinse. Repeat.", "How many programers dose it take to change a light bulb?\nNone - It's a hardware problem", "Why do programmers always mix up Halloween and Christmas? \nBecause Oct 31 equals Dec 25.", "There are only 10 kinds of people in this world: those who know binary and those who don't.", "A programmer walks to the butcher shop and buys a kilo of meat.  An hour later he comes back upset that the butcher shortchanged him by 24 grams.", "'Knock, knock.'\n'Who's there?'\nvery long pause..\n'Java.'", "Programming is 10% science, 20% ingenuity, and 70% getting the ingenuity to work with the science.", "Programming is like sex:\nOne mistake and you have to support it for the rest of your life.", "There are three kinds of lies: Lies, damned lies, and benchmarks.", "All programmers are playwrights, and all computers are lousy actors.", "Have you heard about the new Cray super computer?  It's so fast, it executes an infinite loop in 6 seconds.", "The generation of random numbers is too important to be left to chance.", "'I just saw my life flash before my eyes and all I could see was a close tag.'", "The computer is mightier than the pen, the sword, and usually, the programmer.", "Debugging: Removing the needles from the haystack.", "owmc63^Dz x.xvcu'\n\n'Please excuse my friend,' the second string says, 'He isn't null-terminated.'", "From the Random Shack Data Processing Dictionary:\n\nEndless Loop: n., see Loop, Endless.\nLoop, Endless: n., see Endless Loop.", "One hundred little bugs in the code\nOne hundred little bugs.\nFix a bug, link the fix in,\nOne hundred little bugs in the code."]
